### Домашнее задание

Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
www.finanz.ru...om-vremeni

### Задание 1

In [1]:
import pandas as pd

In [18]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [19]:
len(ratings.movieId.unique())

9066

In [60]:
ratings.groupby('movieId').count().sort_values('rating', ascending=False).head()
# использовал пример с урока, подставил нужные значения, получается фильм с ID 356 имеет наивысший рейтинг

         userId  rating  timestamp
movieId
356         341     341        341
296         324     324        324
318         311     311        311
593         304     304        304
260         291     291        291

In [61]:
ratings['movieId'].value_counts().head(10)
# проверил другим способом, все тот же фильм с наивысшим рейтингом

356     341
296     324
318     311
593     304
260     291
480     274
2571    259
1       247
527     244
589     237
Name: movieId, dtype: int64

In [65]:
all_movies = pd.read_csv('movies.csv')
pd.read_csv('movies.csv')

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9120,162672,Mohenjo Daro (2016),Adventure|Drama|Romance
9121,163056,Shin Godzilla (2016),Action|Adventure|Fantasy|Sci-Fi
9122,163949,The Beatles: Eight Days a Week - The Touring Y...,Documentary
9123,164977,The Gay Desperado (1936),Comedy
9124,164979,"Women of '69, Unboxed",Documentary

In [63]:
best_one = all_movies['movieId'].unique()

In [54]:
title = 0
for t in best_one:
    if t == 365:
        title = all_movies['title'].unique()
        print(title)

 # пытался вытащить фильм по нужному ID, не получилось

['Toy Story (1995)' 'Jumanji (1995)' 'Grumpier Old Men (1995)' ...
 'The Beatles: Eight Days a Week - The Touring Years (2016)'
 'The Gay Desperado (1936)' "Women of '69, Unboxed"]

In [59]:
all_movies.loc[all_movies['movieId'] == 356]

     movieId                title                    genres
321      356  Forrest Gump (1994)  Comedy|Drama|Romance|War

### Комментарий
После долгих проб и ошибок, нашел подсказку на stackoverflow, по ID вытащил название фильма. 
Правильно ли я все сделал?

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [66]:
power = pd.read_csv('power.csv')

In [67]:
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [68]:
power.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [73]:
power.sort_values(by=['country', 'year', 'category'], ascending=[False, True, False]).head()

          country  year  quantity  category
1039388  Zimbabwe  1990       0.0        67
1050501  Zimbabwe  1990    1528.0        67
1052123  Zimbabwe  1990       0.0        67
1057845  Zimbabwe  1990    4150.0        67
1066511  Zimbabwe  1990    3323.0        67

In [95]:
filtered_countries = power[ (power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]

filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [96]:
# категорий 4, 12 и 21 
f_c = filtered_countries
categories = f_c[(f_c['category']==4) | (f_c['category']==12) | (f_c['category']==21) ]
categories.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [97]:
#за период с 2005 по 2010 года.
cat = categories
period = cat[(cat['year']>2004) & (cat['year']<2011) ]
period.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [98]:
period.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 411 entries, 10617 to 253986
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   country   411 non-null    object
 1   year      411 non-null    int64
 2   quantity  411 non-null    float64
 3   category  411 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 16.1+ KB

###  Задание 3 
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти): https://fortrader.org/quotes www.finanz.ru...om-vremeni

In [111]:
norge = pd.read_html('https://www.ssb.no/statbank/list/folkemengde')

ValueError: No tables found

In [112]:
df = pd.DataFrame(norge)

ValueError: Must pass 2-d input. shape=(1, 197, 2)

In [110]:
print(df)

                                                   0
0                             Название   Цена  Из...
1                                Название    Цена...
2                             Название   Цена  Из...
3                                          Назван...
4                                 Название      Ц...
5    Название      Цена  Изменение  Изменение(%) ...
6                                           Назва...
7                                             Наз...
8                                               Н...